app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id: @post.id).count
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 33]]

  def create
    @post = Post.new(content: params[:content], image_name: "default_user.jpg", user_id: @current_user.id)
    @post.store_name = params[:store_name]
    @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "image_name", "store_name", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "a"], ["created_at", "2019-03-31 05:31:33.350098"], ["updated_at", "2019-03-31 05:31:33.350098"], ["image_name", "default_user.jpg"], ["store_name", "a"], ["user_id", 7]]

  def edit
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]

    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "fasfdsafafdsaf"], ["updated_at", "2019-03-27 14:47:52.658424"], ["id", 2]]

  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]